
####################################################################################
# Generated by Vivado 2018.3 built on 'Thu Dec  6 23:36:41 MST 2018' by 'xbuild'
# Command Used: write_xdc -file ss.xdc
####################################################################################


####################################################################################
# Constraints from file : 'pool.xdc'
####################################################################################

#set transition 0.1
create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
#set_max_delay 10ns -from [get_ports fm[*][*]] -to [get_ports pool_out[2]]
set_input_delay -clock clk -min 1.000 [get_ports {fm[0][1]}]
set_output_delay -clock clk -max 6.000 [all_outputs]
set_load 0.000 [get_ports pool_out]
set_property LOAD 0 [get_ports {pool_out[15]}]
set_property LOAD 0 [get_ports {pool_out[14]}]
set_property LOAD 0 [get_ports {pool_out[13]}]
set_property LOAD 0 [get_ports {pool_out[12]}]
set_property LOAD 0 [get_ports {pool_out[11]}]
set_property LOAD 0 [get_ports {pool_out[10]}]
set_property LOAD 0 [get_ports {pool_out[9]}]
set_property LOAD 0 [get_ports {pool_out[8]}]
set_property LOAD 0 [get_ports {pool_out[7]}]
set_property LOAD 0 [get_ports {pool_out[6]}]
set_property LOAD 0 [get_ports {pool_out[5]}]
set_property LOAD 0 [get_ports {pool_out[4]}]
set_property LOAD 0 [get_ports {pool_out[3]}]
set_property LOAD 0 [get_ports {pool_out[2]}]
set_property LOAD 0 [get_ports {pool_out[1]}]
set_property LOAD 0 [get_ports {pool_out[0]}]


# Vivado Generated miscellaneous constraints 

#revert back to original instance
current_instance -quiet
