create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[0][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[0][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[10][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[10][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[11][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[11][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[12][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[12][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[13][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[13][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[14][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[14][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[15][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[15][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[16][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[16][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[17][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[17][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[18][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[18][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[19][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[19][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[1][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[1][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[20][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[20][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[21][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[21][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[22][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[22][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[23][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[23][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[24][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[24][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[25][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[25][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[26][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[26][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[27][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[27][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[28][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[28][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[29][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[29][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[2][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[2][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[30][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[30][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[31][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[31][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[32][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[32][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[33][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[33][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[34][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[34][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[35][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[35][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[36][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[36][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[37][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[37][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[38][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[38][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[39][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[39][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[3][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[3][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[40][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[40][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[41][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[41][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[42][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[42][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[43][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[43][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[44][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[44][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[45][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[45][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[46][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[46][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[47][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[47][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[48][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[48][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[49][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[49][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[4][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[4][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[50][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[50][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[51][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[51][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[52][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[52][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[53][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[53][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[54][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[54][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[55][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[55][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[56][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[56][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[57][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[57][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[58][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[58][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[59][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[59][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[5][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[5][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[60][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[60][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[61][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[61][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[62][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[62][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[63][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[63][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[6][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[6][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[7][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[7][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[8][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[8][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {fm[9][*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {fm[9][*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports rst]
set_output_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {pool_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {pool_out[*]}]
